package com.example.mahjong.domain.calculation.score;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 親の点数一覧
 */
@Getter
@AllArgsConstructor
public enum ParentScore implements Score {
    // 一飜
    一飜_30符(500, 1500),
    一飜_40符(700, 2000),
    一飜_50符(800, 2400),
    一飜_60符(1000, 2900),
    一飜_70符(1200, 3400),

    // 二飜
    二飜_20符(700, 2000),
    二飜_30符(1000, 2900),
    二飜_40符(1300, 3900),
    二飜_50符(1600, 4800),
    二飜_60符(2000, 5800),
    二飜_70符(2300, 6800),

    // 三飜
    三飜_20符(1300, 3900),
    三飜_30符(2000, 5800),
    三飜_40符(2600, 7700),
    三飜_50符(3200, 9600),
    三飜_60符(3900, 11600),

    // 四飜
    四飜_20符(2600, 7700),
    四飜_30符(3900, 11600),
    四飜_40符(5200, 12000), // 満貫扱い
    四飜_50符(6400, 12000), // 満貫扱い
    四飜_60符(7700, 12000), // 満貫扱い

    // 五飜 (満貫)
    満貫(4000, 12000),

    // 六飜から七飜 (跳満)
    跳満(6000, 18000),

    // 八飜から十飜 (倍満)
    倍満(8000, 24000),

    // 十一飜から十二飜 (三倍満)
    三倍満(12000, 36000),


    // 十三飜以上 (役満)
    役満(32000, 48000),
    ;

    // ツモ和了点数 (子供からの支払点数)
    private final int ツモ支払点数;

    // ロン和了点数
    private final int ロン点数;

    @Override
    public boolean is子() {
        return false;
    }

    @Override
    public boolean is親() {
        return true;
    }
}
